# message_handler.py
import random

async def on_message(message):
    if message.author.bot:
        return

    responses_dict = {
         "ควย": ["ควยไร", "อะไรอะ", "มึงบ้าหรอ", "เสร่อ", "เสือก"],
        "55": ["ขำไร", "เอ๋อ", "", "ตลกอ่อ", "ลิงจัด"],
        "เหี้ย": ["เหี้ยไร", "อะไรอะ", "มึงบ้าหรอ", "เสร่อจัด", "เสือก"],
        "ควาย": ["ควยไร", "อะไรมึง", "มึงอะหรอ", "เสร่อจัง", "ไปนอนมั้ย"],
        "ดแม่": ["แม่มึงอ่ะ", "ไอหน้าหี", "ไอหูตุ่น", "ไม่ต้องเสือก", "แม่มึงอะ"],
        "เสือก": ["พ่อมึงอ่ะ", "ไอหน้าหี", "ไอเหลือขอ", "ไม่ต้องเสือก", "ไอลิง"],
        "เสร่อ": ["แม่มึงอะ", "ไอหน้าหี", "ไอเหลือขอ", "ไม่ต้องเสือก", "ไอหมา"],
        "อมึงอ": ["แม่มึงอะ"],
        "ม่มึงอ": ["พ่อมึงอ่ะ"],
        "อมึงต": ["พ่อมึงดิ","พ่อมึงอะ"],
        "ม่มึงต": ["แม่มึงดิ","แม่มึงอะ"],
        "มึง": ["เต็มเปล่า", "แล้ว", "ยังไง", "อ่อ", "55555", "เต็มมั้ยกุถาม", "555"],
        "มืง": ["เต็มเปล่า", "แล้ว", "ยังไง", "อ่อ", "55555", "เต็มมั้ยกุถาม", "555"],
        "กุ": ["เต็มมั้ย", "แล้วไง", "หรอ", "อ่อ", "5443225", "5225", "ไอหมา"],
        "กู": ["เต็มมั้ย", "แล้วไง", "หรอ", "อ่อ", "5443225", "5225", "ไอหมา"],
        "ดอกทอง": ["แม่มึงสิดอกทอง", "กูถามหรอ", "อย่ามึน", "ไอฮิปโป", "ไอลิง"],
        "เอ๋อ": ["เสร่อจัด", "กูถามหรอ", "อย่ามึน", "รั่วเลย", "พ่อมึงอ่ะ"],
        "ไอ": ["โง่", "กูถามหรอ", "ถุ้ย", "ไอสัส", "ควย"],
        "หี": ["หีเปรี้ยวหีเค็ม?", "แล้วทำไม", "ทำไมอ่ะ", "หน้ามึงอ่ะ", "อย่างหลอน"],
        "สั": ["แล้ว", "แล้วทำไม", "โง่", "ซมดง", "หรอๆ"],
        "ปากดี": ["แล้วยังไง", "อ่อหรอ", "ไอจ๋อบ่นไร", "ชุ่วชุ่วโม่ะๆ", "ไอลิง"],
        "ขำ": ["เสือก", "ทำไมอ่ะ", "เสร่อจัด", "ขำหมา", "ให้หมาถาม", "โง่"],
        "ตลก": ["ขำขี้แตก", "หุบปาก", "ฮ่าฮ่า", "ก็ตลกไง", "ขำกลิ้ง"],
        "จอก": ["มึงควรนอน", "สภาพ", "ไม่ได้ถาม", "ไม่ต้องเสือก", "ไอหูตุ่น"],
        "กาก": ["มึงควรนอนอะ", "สภาพจัด", "ไม่ได้ถามนะ", "ไม่ต้องเสือกจั๊ฟ", "ไอปีจอ"],
        "ยุ่ง": ["กูถามหรอ", "สภาพ", "พ่อมึงอ่ะ", "โง่", "ไอหน้าหี"],
        "พ่อ": ["ควยไร", "อะไรอะ", "หลอน", "เสร่อ", "เสือก", "มึงบ้า"],
        "แม่": ["ควยไร", "อะไรอะ", "มึงบ้า", "เสร่อ", "เสือก", "หลอน"],
        "โง่": ["ควยไร", "อะไรอะ", "หลอน", "เสร่อ", "เสือก", "มึงบ้าป้ะ", "ไปนอนนะ"],
        "หลอน": ["เต็มเปล่า", "ไปนอนนะ", "ไร", "เสร่อ", "เสือก", "มึงบ้าอ่อ"],
        "ไร": ["มุนซึง", "ไอควาย", "แล้วควยไร", "ไม่ต้องเสือกเนาะ", "ไอปากแหว่ง"],
        "ไม": ["มินจง", "ไอควาย", "แล้วควยไล", "ไม่ต้องเสือกก", "ไอฟันเหยิน"],
        "ด่า": ["หรอไอเหี้ย", "ไอหมูเป๋", "ไอพิการ", "รั่วจัด", "ไอตาโบ๋","จะสื่อไร","อย่างโง่"],
        "เงียบ": ["มึงเหงาหรอไอเหี้ย", "ควยไร", "หุบปาก", "แล้ว", "ยุ่ง","เสือก","นอนเถอะ"],
    }

    lower_message = message.content.lower()
    response = None

    for key, responses in responses_dict.items():
        if key in lower_message:
            response = random.choice(responses)
            break

    if response:
        await message.channel.send(response)
